[
    {
        "name": "Allison",
        "message": "Happy birthday, Jimmy! Hope one day soon you can have all of the McDonalds your stomach can hold, and that you will share with me and Peach-o!",
        "start": [836, 567],
        "end": [976, 826]
    },
    {
        "name": "Peach",
        "message": "Meow... I won't bite the recycling box today... meowbe...",
        "start": [770, 847],
        "end": [1107, 947]
    },
    {
        "name": "Lin",
        "message": "Go Warriors!",
        "start": [376, 266],
        "end": [704, 481]
    },
    {
        "name": "Iris",
        "message": "Happy Birthday, Jimmy! I hope it's full of joy and good playtime with Peach, perhaps some mochi ice cream, and most of all, some amusement from my virtual gift via Prof Andrew Hauze's cat, Lionel, who seems to want to give you a fairywren bird, who has found a half of a grapefruit! Whew, that's quite a run-on sentence... anyhow, I hope your 29th is a fantastic, sunny day and that we'll soon be able to celebrate in person, for real!",
        "start": [736, 112],
        "end": [1041, 402]
    },
    {
        "name": "Heidy",
        "message": "Happy Birthday Jimmy! For some reason Allison mentioned you wanting a Boster costume, so... here you go.",
        "start": [209, 445],
        "end": [452, 710]
    },
    {
        "name": "Caroline",
        "message": "happy birthday Jimmy! Hope you’re enjoying Jay Chou’s songs virtually even if you can’t go to his concerts in person right now!",
        "start": [478, 568],
        "end": [625, 845]

    },
    {
        "name": "Wendy",
        "message": "Hi Jimmy! For this special birthday, Mayu and I are gifting you four more cats! The big one is Jackfruit, and the little ones are Pomelo, Lychee, and Jujube. You could say that it's a fruit basket! Hope you have an amazing, protein-packed birthday and that your 29th year is the best yet!",
        "start": [992, 526],
        "end": [1294, 850]
    },
    {
        "name": "Rathanak",
        "message": "Hi Jimmy!! I hope you enjoy your very first basketball book. It’s an actual book. I’m not making it up. https://www.amazon.com/My-First-Basketball-Book-Sports/dp/1454914874 May your wingspan be long, your hops be high and your reading speed be fast. Happy 29th birthday!",
        "start": [1152, 347],
        "end": [1315, 695]
    },
    {
        "name": "Paul",
        "message": "here’s the gift on everyone’s wishlist this year! you may want to wear it when you’re around your cat, too. HBD jimmy!",
        "start": [767, 294],
        "end": [892, 546]
    }
]